/*******************************************************************************
* 实验名		 : 静态数码管实验
* 使用的IO	     : 数码管使用P0,键盘使用P3.0、P3.1、P3.2、P3.3
* 实验效果       : 按下K1键，显示0，按下K2键，显示9，按下K3键，显示减1，按下K4键，
*显示加1。
*	注意		 ：由于P3.2口跟红外线共用，所以做按键实验时为了不让红外线影响实验
*效果，最好把红外线先取下来。
*******************************************************************************/
#include<reg51.h>
#include<intrins.h>	

#define GPIO_DIG P0

sbit LSA=P2^2;
sbit LSB=P2^3;
sbit LSC=P2^4;

sbit K1=P3^1;
sbit K2=P3^0;
sbit K3=P3^2;
sbit K4=P3^3;

unsigned char code DIG_CODE[10]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};//显示0~9的值

void Delay10ms();   //延时10ms
 
/*******************************************************************************
* 函 数 名        : main
* 函数功能		  : 主函数
* 输    入        : 无
* 输    出        : 无
*******************************************************************************/
void main(void)
{
	unsigned int i,j;
	LSA=0;
	LSB=0;
	LSC=0;
	while(1)
	{
		if(K1==0)		//检测按键K1是否按下
		{
			Delay10ms();	//消除抖动
			if(K1==0)
			{
				j=0;
			}	
			while((i<50)&&(K1==0))	 //检测按键是否松开
			{
				Delay10ms();
				i++;
			}
			i=0;
		}		
		if(K2==0)			 //检测按键K2是否按下
		{
			Delay10ms();
			if(K2==0)
			{
				j=9;
			}
			while((i<50)&&(K2==0))
			{
				Delay10ms();
				i++;
			}
			i=0;
		}			
		if(K3==0)				//检测按键K3是否按下
		{
			Delay10ms();
			if(K3==0)
			{
				j--;
				if(j>9)
					j=9;				
			}
			while((i<50)&&(K3==0))
			{
				Delay10ms();
				i++;
			}
			i=0;
		}
			
		if(K4==0)					//检测按键K4是否按下
		{
			Delay10ms();
			if(K4==0)
			{
				j++;
				if(j>9)
					j=0;
			}		
			while((i<50)&&(K4==0))
			{
				Delay10ms();
				i++;
			}
			i=0;
		}
		GPIO_DIG=DIG_CODE[j];
	}				
}
/*******************************************************************************
* 函 数 名         : Delay10ms
* 函数功能		   : 延时函数，延时10ms
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Delay10ms(void)   //误差 0us
{
    unsigned char a,b,c;
    for(c=1;c>0;c--)
        for(b=38;b>0;b--)
            for(a=130;a>0;a--);
}