#include"lcd.h"
/*******************************************************************************
* 函数名         : Delay1ms
* 函数功能		   : 延时函数，延时1us
* 输入           : a
* 输出         	 : 无
*******************************************************************************/

void Delay1ms(unsigned int a)
{
	unsigned int b,c;
	for(c=a;c>0;c--)
		for(b=110;b>0;b--);
}
/*******************************************************************************
* 函数名         : LcdWriteCom
* 函数功能		   : 向LCD写入一个字节的命令
* 输入           : com
* 输出         	 : 无
*******************************************************************************/

void LcdWriteCom(unsigned char com)	  //写入命令
{
	RS=0;
	RW=0;
	GPIO_LCD=com;
	Delay1ms(10);
	LCDE=1;
	Delay1ms(10);
	LCDE=0;
}
/*******************************************************************************
* 函数名         : LcdWriteData
* 函数功能		   : 向LCD写入一个字节的数据
* 输入           : dat
* 输出         	 : 无
*******************************************************************************/		   
		   
void LcdWriteData(unsigned char dat)			//写入数据
{
	RS=1;
	RW=0;
	GPIO_LCD=dat;
	Delay1ms(10);
	LCDE=1;
	Delay1ms(10);
	LCDE=0;
}
/*******************************************************************************
* 函数名         : LcdInit()
* 函数功能		   : 初始化LCD屏
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/		   

void LcdInit()						  //LCD初始化子程序
{
 	LcdWriteCom(0x38);  //开显示
	LcdWriteCom(0x0c);  //开显示不显示光标
	LcdWriteCom(0x06);  //写一个指针加1
	LcdWriteCom(0x01);  //清屏
	LcdWriteCom(0x80);  //设置数据指针起点
}
