/*******************************************************************************
* 实验名			   : 定时器实验
* 使用的IO	     : 
* 实验效果       :LED每隔500ms左移一次
*	注意					 ：
*******************************************************************************/
#include<reg51.h>	
#include<intrins.h>
#define GPIO_LED P2

void TimerConfiguration();
unsigned char Time;
/*******************************************************************************
* 函数名         : main
* 函数功能		   : 主函数
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/
void main(void)
{
	Time=0;
	GPIO_LED=0XFE;
	TimerConfiguration();
	while(1)
	{
		if(Time==10)
		{
			GPIO_LED=_crol_(GPIO_LED,1);
			Time=0;
		}

	}				
}

/*******************************************************************************
* 函数名         : TimerConfiguration()
* 函数功能		   : 配置定时器值
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/		   

void TimerConfiguration()
{
    TMOD = 0x01; //选择工作方式1
    TH0 = 0x3C;	 //设置初始值,定时50MS
    TL0 = 0xB0; 
    EA = 1;			 //打开总中断
    ET0 = 1;		 //打开定时器0中断
    TR0 = 1;		 //启动定时器0
}
/*******************************************************************************
* 函数名         : Timer0()
* 函数功能		   : 定时器0中断函数
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/		   

void Timer0() interrupt 1
{
	  TH0 = 0x3C;	 //设置初始值
    TL0 = 0xB0;
		Time++;
}