/*******************************************************************************
* ÊµÑéÃû			   :ÎÂ¶ÈÏÔÊ¾ÊµÑé
* Ê¹ÓÃµÄIO	     : 
* ÊµÑéĞ§¹û       :1602ÏÔÊ¾ÎÂ¶È
*	×¢Òâ					 £º
*******************************************************************************/

#include<reg51.h>
#include"temp.h"

//ÊıÂë¹ÜIO
#define DIG	P0
sbit LSA=P2^2;
sbit LSB=P2^3;
sbit LSC=P2^4;

unsigned char code DIG_CODE[10]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f};
unsigned char Num=0;
unsigned int disp[8]={0x3f,0x3f,0x3f,0x3f,0x3f,0x3f,0x3f,0x3f};

void LcdDisplay(int);
void Timer0Configuration();

/*******************************************************************************
* º¯ÊıÃû         : main
* º¯Êı¹¦ÄÜ		   : Ö÷º¯Êı
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void main()
{
    Timer0Configuration();
	while(1)
	{
		LcdDisplay(Ds18b20ReadTemp());
	}
}

/*******************************************************************************
* º¯ÊıÃû         : LcdDisplay()
* º¯Êı¹¦ÄÜ		   : LCDÏÔÊ¾¶ÁÈ¡µ½µÄÎÂ¶È
* ÊäÈë           : v
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void LcdDisplay(int temp) 	 //lcdÏÔÊ¾
{
    
  	unsigned char datas[] = {0, 0, 0, 0, 0}; //¶¨ÒåÊı×é
	float tp;  
	if(temp< 0)				//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
        disp[2] = 0x40;
		//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
 
  	}
 	else
  	{	
        disp[2] = 0;		
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿
		//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
    disp[0] = 0;
    disp[1] = 0;
    disp[3] = DIG_CODE[temp / 10000];
	disp[4] = DIG_CODE[temp % 10000 / 1000];
	disp[5] = DIG_CODE[temp % 1000 / 100] | 0x80;
	disp[6] = DIG_CODE[temp % 100 / 10];
	disp[7] = DIG_CODE[temp % 10];
 
}

/*******************************************************************************
* º¯ÊıÃû         : Timer0Configuration()
* º¯Êı¹¦ÄÜ		   : ÉèÖÃ¼ÆÊ±Æ÷
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void Timer0Configuration()
{
	TMOD=0X02;//Ñ¡ÔñÎª¶¨Ê±Æ÷Ä£Ê½£¬¹¤×÷·½Ê½2£¬½öÓÃTRX´ò¿ªÆô¶¯¡£

	TH0=0X9C;	//¸ø¶¨Ê±Æ÷¸³³õÖµ£¬¶¨Ê±100us
	TL0=0X9C;	
	ET0=1;//´ò¿ª¶¨Ê±Æ÷0ÖĞ¶ÏÔÊĞí
	EA=1;//´ò¿ª×ÜÖĞ¶Ï
	TR0=1;//´ò¿ª¶¨Ê±Æ÷		
}

/*******************************************************************************
* º¯ÊıÃû         : DigDisplay() interrupt 1
* º¯Êı¹¦ÄÜ		   : ÖĞ¶ÏÊıÂë¹ÜÏÔÊ¾
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void DigDisplay() interrupt 1
{
//¶¨Ê±Æ÷ÔÚ¹¤×÷·½Ê½¶ş»á×Ô¶¯ÖØ×°³õ£¬ËùÒÔ²»ÓÃÔÚ¸³Öµ¡£
//	TH0=0X9c;//¸ø¶¨Ê±Æ÷¸³³õÖµ£¬¶¨Ê±1ms
//	TL0=0X00;		
	DIG=0; //ÏûÒş
	switch(Num)	 //Î»Ñ¡£¬Ñ¡ÔñµãÁÁµÄÊıÂë¹Ü£¬
	{
		case(7):
			LSA=0;LSB=0;LSC=0; break;
		case(6):
			LSA=1;LSB=0;LSC=0; break;
		case(5):
			LSA=0;LSB=1;LSC=0; break;
		case(4):
			LSA=1;LSB=1;LSC=0; break;
		case(3):
			LSA=0;LSB=0;LSC=1; break;
		case(2):
			LSA=1;LSB=0;LSC=1; break;
		case(1):
			LSA=0;LSB=1;LSC=1; break;
		case(0):
			LSA=1;LSB=1;LSC=1; break;	
	}
	DIG=disp[Num]; //¶ÎÑ¡£¬Ñ¡ÔñÏÔÊ¾µÄÊı×Ö¡£
	Num++;
	if(Num>7)
		Num=0;
}
